Tekla Open API Reference for Tekla Structures 2025
EnvironmentVariables Class
 The EnvironmentVariables class contains a sorted list specializing in getting active environment variables and advanced option settings. It also checks options.ini files in the active model folder as well as options_user.ini files.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Dialog.UIControls.EnvironmentVariables
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static class EnvironmentVariables
Public NotInheritable Class EnvironmentVariables
The EnvironmentVariables type exposes the following members.
Methods
Name | Description
Add
 Adds a variable to the list.
Get
 Gets a key.
GetEnvironmentVariable
 Gets an environment variable.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace